## Dataset Exploration Tokyo

### Package Import

In [4]:
import pandas as pd
import numpy as np

In [5]:
tokyo_df = pd.read_csv('.\dataset_tsmc2014\dataset_TSMC2014_TKY.txt', delimiter = "\t", names=["user_id", "venue_id", "venue_category_id", "venue_category_name", "latitude", "longitude", "timezone_offset", "UTC_time"])

In [6]:
tokyo_df.head()

,user_id,venue_id,venue_category_id,venue_category_name,latitude,longitude,timezone_offset,UTC_time
0,1541,4f0fd5a8e4b03856eeb6c8cb,4bf58dd8d48988d10c951735,Cosmetics Shop,35.705101,139.619590,540,Tue Apr 03 18:17:18 +0000 2012
1,868,4b7b884ff964a5207d662fe3,4bf58dd8d48988d1d1941735,Ramen / Noodle House,35.715581,139.800317,540,Tue Apr 03 18:22:04 +0000 2012
2,114,4c16fdda96040f477cc473a5,4d954b0ea243a5684a65b473,Convenience Store,35.714542,139.480065,540,Tue Apr 03 19:12:07 +0000 2012
3,868,4c178638c2dfc928651ea869,4bf58dd8d48988d118951735,Food & Drink Shop,35.725592,139.776633,540,Tue Apr 03 19:12:13 +0000 2012
4,1458,4f568309e4b071452e447afe,4f2a210c4b9023bd5841ed28,Housing Development,35.656083,139.734045,540,Tue Apr 03 19:18:23 +0000 2012

In [7]:
tokyo_df_filtered = tokyo_df[["user_id", "venue_id", "venue_category_name", "latitude", "longitude", "UTC_time"]]

In [8]:
tokyo_df_filtered.head()

,user_id,venue_id,venue_category_name,latitude,longitude,UTC_time
0,1541,4f0fd5a8e4b03856eeb6c8cb,Cosmetics Shop,35.705101,139.619590,Tue Apr 03 18:17:18 +0000 2012
1,868,4b7b884ff964a5207d662fe3,Ramen / Noodle House,35.715581,139.800317,Tue Apr 03 18:22:04 +0000 2012
2,114,4c16fdda96040f477cc473a5,Convenience Store,35.714542,139.480065,Tue Apr 03 19:12:07 +0000 2012
3,868,4c178638c2dfc928651ea869,Food & Drink Shop,35.725592,139.776633,Tue Apr 03 19:12:13 +0000 2012
4,1458,4f568309e4b071452e447afe,Housing Development,35.656083,139.734045,Tue Apr 03 19:18:23 +0000 2012

### Explore the dataset

In [9]:
counted_frame = tokyo_df_filtered.groupby(['user_id']).size().reset_index(name='counts')

In [10]:
counted_frame.head()

   user_id  counts
0        1     111
1        2     206
2        3     261
3        4     200
4        5     235

Below shows the statistics of the count variable

In [11]:
counted_frame['counts'].describe()

count    2293.000000
mean      250.197558
std       221.570455
min       100.000000
25%       126.000000
50%       173.000000
75%       273.000000
max      2991.000000
Name: counts, dtype: float64

In [12]:
def general_frequent_visited_categories(df):
    ret_df = df.groupby(['venue_category_name']).size().reset_index(name='counts')
    ret_df = ret_df.sort_values(by=['counts'])
    return ret_df

In [14]:
g = general_frequent_visited_categories(tokyo_df_filtered)
pd.set_option('display.max_rows', g.shape[0]+1)
print(g)

                 venue_category_name  counts
0                  Afghan Restaurant       1
211  Southern / Soul Food Restaurant       1
110           Gluten-free Restaurant       1
8                   Arepa Restaurant       1
205                         Ski Area       1
..                               ...     ...
127              Japanese Restaurant   15680
62                 Convenience Store   16833
185            Ramen /  Noodle House   17303
220                           Subway   41666
235                    Train Station  200428

[247 rows x 2 columns]